БИТУправление_медицинским_центром_демо/src/Reports/ИсторическийАнализЗагруженностиСотрудников/ИсторическийАнализЗагруженностиСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ИсторическийАнализЗагруженностиСотрудников</name>
</mdclass:Report>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ГрафикиРаботы/ГрафикиРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГрафикиРаботы</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </resources>
  <resources>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Название</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Кабинет</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючУникальностиЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидВремени</name>
    <type>
      <types>CatalogRef.ВидыВремениГрафика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСобытия</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Documents/Заявка/Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заявка</name>
  <posting>Deny</posting>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>DefinedType.КомментарийДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>Перенесенная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НесколькоСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.ВидыСостоянийЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДляОтката</name>
    <type>
      <types>CatalogRef.ВидыСостоянийЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>Кабинет</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКлиента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХочуРаньше</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПримечаниеХочуРаньше</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборХочуРаньше</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеЗаписиВРасписание</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимДлительностиЗаявки</name>
    <type>
      <types>EnumRef.РежимДлительностиЗаявки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование1</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование2</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование3</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьИзмененаВручную</name>
      <comment>Используется в форме заявки при установке нормативной продолжительности</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтборыХочуРаньше</name>
    <attributes>
      <name>Фильтр</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.КатегорииВыработки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УчаствуетВКалендарномПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Специализация</name>
    <type>
      <types>CatalogRef.КатегорииВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Архив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойСпособЗаполненияГрафика</name>
    <type>
      <types>CatalogRef.СпособыЗаполненияГрафиковРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьПриема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимДлительностиЗаявки</name>
    <type>
      <types>EnumRef.РежимДлительностиЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияДляЖЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <comment>Страховой номер индивидуального лицевого счета пенсионного свидетельства </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Специализации</name>
    <attributes>
      <name>Специализация</name>
      <type>
        <types>CatalogRef.КатегорииВыработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СпециализацииФРМР</name>
    <attributes>
      <name>Специализация</name>
      <type>
        <types>CatalogRef.КлассификаторыМинЗдрава</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Reports/ИсторическийАнализЗагруженностиСотрудников/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	ИтоговаяТаблица = Новый ТаблицаЗначений;
	
	ПараметрСписокДатНачала = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Дата"));
	ПараметрСписокКоличествоДней = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КоличествоДней"));
	ПараметрВключатьТекущуюДату = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВключатьТекущуюДату")).Значение;
		
	// Если только один элемент
	Если ТипЗнч(ПараметрСписокДатНачала.Значение) = Тип("Дата") Тогда
		Значение = ПараметрСписокДатНачала.Значение;
		ПараметрСписокДатНачала.Значение = Новый СписокЗначений;
		ПараметрСписокДатНачала.Значение.Добавить(Значение);
	КонецЕсли;
	
	Если ТипЗнч(ПараметрСписокКоличествоДней.Значение) = Тип("Число") Тогда
		Значение = ПараметрСписокКоличествоДней.Значение;
		ПараметрСписокКоличествоДней.Значение = Новый СписокЗначений;
		ПараметрСписокКоличествоДней.Значение.Добавить(Значение);
	КонецЕсли;
	
	СписокДатНачала = Новый Массив;
	// Если не заполнен список дат, в массив добавится текущая дата
	Если Не ЗначениеЗаполнено(ПараметрСписокДатНачала.Значение) Тогда
		СписокДатНачала.Добавить(НачалоДня(ТекущаяДата()));
	Иначе
		Для Каждого Дата Из ПараметрСписокДатНачала.Значение Цикл
			СписокДатНачала.Добавить(Дата.Значение);
		КонецЦикла;
	КонецЕсли;
		
	СписокКоличествоДней = Новый Массив;
	// Если не заполнен список количества дней, в массив добавится 1
	Если Не ЗначениеЗаполнено(ПараметрСписокКоличествоДней.Значение) Тогда
		СписокКоличествоДней.Добавить(1);
	Иначе
		Для Каждого КоличествоДней Из ПараметрСписокКоличествоДней.Значение Цикл
			СписокКоличествоДней.Добавить(КоличествоДней.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Если (ПараметрВключатьТекущуюДату
		И СписокДатНачала.Найти(НачалоДня(ТекущаяДата())) = Неопределено)
	Тогда
		СписокДатНачала.Добавить(НачалоДня(ТекущаяДата()));
	КонецЕсли;
	
	ВидыНерабочегоВремени = ГрафикиСотрудников.ПолучитьВидыВремени(Ложь);
	ВидыРабочегоВремени = ГрафикиСотрудников.ПолучитьВидыВремени(Истина);
	
	Для Каждого ДатаНачала Из СписокДатНачала Цикл
		
		СписокДат = Новый Массив;
		Для Каждого КоличествоДней Из СписокКоличествоДней Цикл
			СписокДат.Добавить(ДатаНачала + 86400 * (КоличествоДней));
		КонецЦикла;
		
		ТаблицаСотрудников = ПолучитьСписокСотрудников(СписокДат, ВидыНерабочегоВремени, ВидыРабочегоВремени);
		ТаблицаСотрудников.Колонки.Добавить("ВремяЗаявок",					Новый ОписаниеТипов("Число"));
		ТаблицаСотрудников.Колонки.Добавить("КоличествоДней",				Новый ОписаниеТипов("Число"));
		ТаблицаСотрудников.Колонки.Добавить("Дата",							Новый ОписаниеТипов("Дата"));
		ТаблицаСотрудников.Колонки.Добавить("ПродолжительностьПоГрафику",	Новый ОписаниеТипов("Число"));
		
		Для Каждого КоличествоДней Из СписокКоличествоДней Цикл
			
			Начало = ДатаНачала + 86400 * (КоличествоДней);
			Конец = КонецДня(Начало);
			
			ТаблицаРабочегоВремени = ГрафикиСотрудников.ПолучитьРабочееВремяЗаПериод(Начало, Конец, Ложь, Ложь,, Тип("СправочникСсылка.Сотрудники"));
			ТаблицаРабочегоВремени.Колонки.Добавить("ПродолжительностьПоГрафику", Новый ОписаниеТипов("Число"));
			ТаблицаРабочегоВремени.Колонки.Добавить("Специализация");
			Для Каждого Строка Из ТаблицаРабочегоВремени Цикл
				Строка.ПродолжительностьПоГрафику = Окр((Строка.ВремяОкончания - Строка.ВремяНачала)/60);
				Строка.Специализация = Строка.Сотрудник.Специализация;
			КонецЦикла;
			ТаблицаРабочегоВремени.Свернуть("Филиал, Сотрудник, Специализация", "ПродолжительностьПоГрафику");
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), ЗаявкаРаботы.Продолжительность, МИНУТА) КАК ВремяЗаявок,
			|	НАЧАЛОПЕРИОДА(Заявка.ДатаНачала, ДЕНЬ) КАК Дата,
			|	ВЫБОР
			|		КОГДА ЗаявкаРаботы.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗаявкаРаботы.Ссылка.Сотрудник
			|		ИНАЧЕ ЗаявкаРаботы.Сотрудник
			|	КОНЕЦ КАК Сотрудник,
			|	Заявка.Филиал КАК Филиал,
			|	ВЫБОР
			|		КОГДА ЗаявкаРаботы.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|			ТОГДА ЗаявкаРаботы.Ссылка.Сотрудник.Специализация
			|		ИНАЧЕ ЗаявкаРаботы.Сотрудник.Специализация
			|	КОНЕЦ КАК Специализация
			|ИЗ
			|	Документ.Заявка.Работы КАК ЗаявкаРаботы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК Заявка
			|		ПО ЗаявкаРаботы.Ссылка = Заявка.Ссылка
			|ГДЕ
			|	Заявка.Состояние <> ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаявок.Отменена)
			|	И НЕ Заявка.ПометкаУдаления
			|	И Заявка.ДатаНачала МЕЖДУ &ДатаНачала И КОНЕЦПЕРИОДА(&ДатаНачала, ДЕНЬ)";
			
			Запрос.УстановитьПараметр("Дата", Начало);
			Запрос.УстановитьПараметр("ДатаНачала", Начало);
			
			ТаблицаВремениЗаявок = Запрос.Выполнить().Выгрузить();
			ТаблицаВремениЗаявок.Свернуть("Филиал, Сотрудник, Специализация", "ВремяЗаявок");
			
			Если ИтоговаяТаблица.Количество() = 0 Тогда
				ИтоговаяТаблица = ТаблицаРабочегоВремени.СкопироватьКолонки();
				ИтоговаяТаблица.Колонки.Добавить("ВремяЗаявок",		Новый ОписаниеТипов("Число"));
				ИтоговаяТаблица.Колонки.Добавить("КоличествоДней",	Новый ОписаниеТипов("Число"));
				ИтоговаяТаблица.Колонки.Добавить("Дата",			Новый ОписаниеТипов("Дата"));;
			КонецЕсли;
			
			Для Каждого Сотрудник Из ТаблицаСотрудников Цикл
				
				НоваяСтрока = ИтоговаяТаблица.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,Сотрудник);
				
				Отбор = Новый Структура;
				Отбор.Вставить("Филиал",Сотрудник.Филиал);
				Отбор.Вставить("Сотрудник",Сотрудник.Сотрудник);
				Отбор.Вставить("Специализация",Сотрудник.Специализация);
				
				НайденныеСтрокиПродолжительности = ТаблицаРабочегоВремени.НайтиСтроки(Отбор);
				НайденныеСтрокиВремениЗаявок = ТаблицаВремениЗаявок.НайтиСтроки(Отбор);
				Если НайденныеСтрокиПродолжительности.Количество() > 0 Тогда
					НоваяСтрока.ПродолжительностьПоГрафику = НайденныеСтрокиПродолжительности[0].ПродолжительностьПоГрафику;
				КонецЕсли;
				Если НайденныеСтрокиВремениЗаявок.Количество() > 0 Тогда
					НоваяСтрока.ВремяЗаявок = НайденныеСтрокиВремениЗаявок[0].ВремяЗаявок;
				КонецЕсли;
				НоваяСтрока.КоличествоДней = КоличествоДней;
				НоваяСтрока.Дата = ДатаНачала;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	ВнешниеНаборыДанных = Новый Структура("Данные",ИтоговаяТаблица);
	
	ОсновнойМакетОформления = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ОсновнойМакетОформленияСКД");
	КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
	ПараметрМакет = КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("МакетОформления");
	ПараметрМакет.Значение = ОсновнойМакетОформления;
	ПараметрМакет.Использование = Истина;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	
	// Инициализация процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	// Получение результата
	ПроцессорВыводаРезультатаКомпоновкиДанных = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	
	ПроцессорВыводаРезультатаКомпоновкиДанных.УстановитьДокумент(ДокументРезультат);
	ПроцессорВыводаРезультатаКомпоновкиДанных.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСписокСотрудников(СписокДат, ВидыНерабочегоВремени, ВидыРабочегоВремени)
	
	ТаблицаСотрудников = Новый ТаблицаЗначений;
	Для Каждого Дата Из СписокДат Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ГрафикиРаботы.Сотрудник КАК Сотрудник,
			|	ГрафикиРаботы.ВидВремени КАК ВидВремени,
			|	ГрафикиРаботы.Филиал КАК Филиал
			|ПОМЕСТИТЬ Графики
			|ИЗ
			|	РегистрСведений.ГрафикиРаботы КАК ГрафикиРаботы
			|ГДЕ
			|	ГрафикиРаботы.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И НЕ ГрафикиРаботы.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|	И ГрафикиРаботы.Сотрудник.УчаствуетВКалендарномПланировании = ИСТИНА
			|	И (ГрафикиРаботы.Филиал = &Филиал
			|			ИЛИ &Филиал = НЕОПРЕДЕЛЕНО)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Графики.Сотрудник КАК Сотрудник,
			|	Графики.Филиал КАК Филиал,
			|	Графики.Сотрудник.Специализация КАК Специализация
			|ИЗ
			|	Графики КАК Графики
			|ГДЕ
			|	(Графики.ВидВремени В (&ВидыРабочегоВремени)
			|			ИЛИ Графики.ВидВремени В (&ВидыНерабочегоВремени))
			|
			|УПОРЯДОЧИТЬ ПО
			|	Графики.Сотрудник";
		
		Запрос.УстановитьПараметр("ВидыНерабочегоВремени", ВидыНерабочегоВремени);
		Запрос.УстановитьПараметр("ВидыРабочегоВремени", ВидыРабочегоВремени);
		Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата));
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата));
		Запрос.УстановитьПараметр("Филиал", Неопределено);
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если ТаблицаСотрудников.Количество() = 0 Тогда
			ТаблицаСотрудников = РезультатЗапроса.СкопироватьКолонки();
		КонецЕсли;
		
		Для Каждого Строка Из РезультатЗапроса Цикл
			НовыйСотрудник = ТаблицаСотрудников.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйСотрудник, Строка);
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаСотрудников.Свернуть("Сотрудник, Филиал, Специализация");
	
	Возврат ТаблицаСотрудников;
	
КонецФункции

#КонецОбласти
